{
  "projects": [
    {
      "id": "parlezpal",
      "title": "ParlezPal",
      "description": [
        "🤖 An AI-powered language learning web app I've built to improve my own French speaking and listening skills.",
        "The project began after I found many existing AI language tools to be expensive and overly complicated.",
        "My goal is to create a streamlined app where users can practise with an AI tutor."
      ],
      "assets": [],
      "technologies": [
        "Typescript",
        "React",
        "Next.js",
        "Vercel",
        "OpenAI",
        "Gemini"
      ],
      "url": "https://parlezpal.vercel.app/",
      "github": "/parlezpal"
    },
    {
      "id": "betmax",
      "title": "BetMax",
      "description": [
        "⚽ BetMax is a TypeScript CLI tool that finds value bets in football player markets.",
        "It works by scraping current player statistics and applies Poisson distribution models to calculate fair odds for player markets.",
        "The tool then compares these predictions against live bookmaker odds, generating a spreadsheet of opportunities ranked by Expected Value (EV) to identify mathematically advantageous bets.",
        "So far this season, I'm up 73% by following the opportunities identified by BetMax!"
      ],
      "assets": [
        {
          "name": "demo.gif",
          "description": "Demo getting best odds for a match."
        },
        {
          "name": "output.png",
          "description": "Output spreadsheet"
        }
      ],
      "technologies": [
        "Typescript",
        "Node.js"
      ],
      "github": "/betmax"
    },
    {
      "id": "sound_system",
      "title": "DIY Sound System",
      "description": [
        "🔉 Over the past few years, I’ve designed and built my own sound system, which I have run at small live music events across London.",
        "I’ve enjoyed being hands-on with the whole process, from building and wiring the cabinets to programming the system for each event."
      ],
      "assets": [
        {
          "name": "1.jpg",
          "description": ""
        },
        {
          "name": "2.jpg",
          "description": ""
        },
        {
          "name": "3.jpg",
          "description": ""
        },
        {
          "name": "4.jpg",
          "description": ""
        }
      ]
    },
    {
      "id": "subtitle_ai",
      "title": "SubtitleAI",
      "description": [
        "🎬 A simple, interactive Python CLI tool to generate and embed multilingual subtitles. It can be used on local files or fetch directly from Youtube."
      ],
      "assets": [
        {
          "name": "demo.gif",
          "description": "Demo adding French subtitles to a local file."
        },
        {
          "name": "output.gif",
          "description": "Clip of output file with French subtitles."
        }
      ],
      "technologies": [
        "Python",
        "ElevenLabs",
        "AssemblyAI"
      ],
      "github": "/subtitle-ai"
    },
    {
      "id": "goodness",
      "title": "Goodness",
      "description": [
        "🎉 I previously co-founded my own promotion company, Goodness, with a couple of friends from university at the start of 2016.",
        "We ran a events across London, Oxford, Manchester and Bristol, ranging from intimate basements to big day parties."
      ],
      "assets": [
        {
          "name": "1.png",
          "description": "Goodness Day & Night Party at Fox & Firkin"
        },
        {
          "name": "2.jpg",
          "description": "Goodness club night at Corsica Studios"
        },
        {
          "name": "3.jpg",
          "description": "Goodness live event at Iklectik"
        },
        {
          "name": "4.jpg",
          "description": "Goodness club night at Venue MOT"
        }
      ],
      "url": "https://www.instagram.com/goodness_uk/"
    }
  ]
}